{
  "project": "Remote MCP Server for Donut CLI",
  "branchName": "ralph/remote-mcp-server",
  "description": "Users cannot easily connect AI coding assistants (Claude Code, Cursor, VS Code) to Donut's trading tools. Currently, using Donut via MCP requires local installation, building from source, and manual configuration. This PRD adds HTTP-based MCP endpoint to enable one-command setup.",
  "userStories": [
    {
      "id": "RMS-001",
      "title": "MCP Endpoint Discovery",
      "description": "As a developer using Claude Code, I want to add Donut's MCP server with a single command so that I can immediately access trading tools without local installation.",
      "acceptanceCriteria": [
        "/mcp endpoint responds to HTTP POST requests with JSON-RPC 2.0",
        "Endpoint returns valid MCP protocol responses for initialize method",
        "claude mcp add -t http donut http://localhost:4567/mcp works without errors",
        "Claude Code shows donut in claude mcp list after adding",
        "Verify at localhost:4567/mcp with curl POST request",
        "Typecheck passes",
        "Lint passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Implemented: POST /mcp endpoint with JSON-RPC 2.0, initialize/tools methods supported"
    },
    {
      "id": "RMS-002",
      "title": "Tool Listing via MCP Protocol",
      "description": "As an AI assistant, I want to discover available Donut tools via the MCP tools/list method so that I can present trading capabilities to users.",
      "acceptanceCriteria": [
        "MCP tools/list method returns all 50+ Donut tools",
        "Each tool includes name, description, and inputSchema",
        "Tools are grouped by category in response metadata",
        "Response format matches MCP specification",
        "Typecheck passes",
        "Lint passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Implemented: tools/list returns 26 tools with name, description, inputSchema. Category grouping deferred."
    },
    {
      "id": "RMS-003",
      "title": "Tool Execution via MCP Protocol",
      "description": "As an AI assistant, I want to invoke Donut tools via the MCP tools/call method so that I can execute trades and queries on behalf of users.",
      "acceptanceCriteria": [
        "MCP tools/call method routes to correct tool handler",
        "Tool arguments are validated against inputSchema",
        "Successful executions return tool results in MCP format",
        "Errors return proper MCP error responses with JSON-RPC error codes",
        "Internal exceptions are caught and returned as MCP errors (not HTTP 500)",
        "Existing tool handlers work unchanged (backward compatible)",
        "Typecheck passes",
        "Lint passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Implemented: tools/call routes to executeToolHandler, returns MCP format with proper error codes"
    },
    {
      "id": "RMS-004",
      "title": "Authentication Integration",
      "description": "As a user connecting from Claude Code, I want MCP requests to use my existing Donut credentials so that my trading account is securely linked without re-authenticating.",
      "acceptanceCriteria": [
        "MCP endpoint checks for existing credentials from donut auth",
        "Unauthenticated requests return 401 with message: Run donut auth first",
        "Authenticated requests include user context from stored credentials",
        "Existing tool handlers receive same auth context as CLI",
        "Token refresh happens automatically when near expiry (existing behavior preserved)",
        "Typecheck passes",
        "Lint passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Implemented: Auth check on tools/call, 401 for unauthenticated, auth status in initialize response"
    },
    {
      "id": "RMS-005",
      "title": "MCP Client Configuration Documentation",
      "description": "As a developer, I want clear setup instructions so that I can connect my preferred MCP client to Donut in under 60 seconds.",
      "acceptanceCriteria": [
        "README includes Claude Code setup command",
        "README includes Cursor configuration JSON",
        "README includes VS Code setup steps",
        "README includes Claude Desktop configuration",
        "Each client verified to work end-to-end",
        "Typecheck passes",
        "Lint passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Implemented: README updated with Claude Code, Cursor, VS Code, Claude Desktop setup instructions. Added donut web command."
    }
  ]
}
